In [2]:
import pandas as pd

In [5]:
df_1=pd.read_csv('Region.csv')

In [6]:
df_1

        acct_id        region
0             1      New York
1             2        Dallas
2             3   Los Angeles
3             4       Chicago
4             5  Philadelphia
...         ...           ...
100168    99996       Chicago
100169    99997      New York
100170    99998     San Diego
100171    99999       Chicago
100172   100000        Dallas

[100173 rows x 2 columns]

In [9]:
df_2=pd.read_csv('fico.csv').drop('acct_id',axis=1)

In [11]:
df_final=pd.concat((df_1,df_2),axis=1)

In [12]:
df_final_new=df_final.copy()

In [13]:
df_final_new

        acct_id        region FICO
0             1      New York  768
1             2        Dallas  850
2             3   Los Angeles  677
3             4       Chicago  843
4             5  Philadelphia  796
...         ...           ...  ...
100168    99996       Chicago  NaN
100169    99997      New York  NaN
100170    99998     San Diego  NaN
100171    99999       Chicago  NaN
100172   100000        Dallas  NaN

[100173 rows x 3 columns]

In [20]:
df_final_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100173 entries, 0 to 100172
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   acct_id  100173 non-null  int64
 1   region   100173 non-null  object
 2   FICO     70398 non-null   object
dtypes: int64(1), object(2)
memory usage: 2.3+ MB

CONVERTING USELESS VALUES INTO NONE

In [21]:
def filter_for_min_max(num):
    try:
        int(num)
        return num
        
    except:
        return None

In [27]:
df_final_new=df_final_new[df_final_new['FICO'].apply(filter_for_min_max).notnull()]

CONVERTING FICO SCORE TO INT

In [30]:
df_final_new['FICO']=df_final_new['FICO'].astype(int)

C:\Users\hp\AppData\Local\Temp/ipykernel_11268/3738600947.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_final_new['FICO']=df_final_new['FICO'].astype(int)

In [32]:
df_final_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70396 entries, 0 to 100004
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   acct_id  70396 non-null  int64
 1   region   70396 non-null  object
 2   FICO     70396 non-null  int32
dtypes: int32(1), int64(1), object(1)
memory usage: 1.9+ MB

In [38]:
pd.DataFrame(df_final_new.groupby('region')['FICO'].mean()).sort_values(by=['FICO']).head(1)

                   FICO
region
San Antonio  784.534652

In [42]:
pd.DataFrame(df_final_new.groupby('region')['FICO'].mean()).sort_values(by=['FICO']).iloc[-2]

FICO    786.515207
Name: Charlotte, dtype: float64